{"version": "https://jsonfeed.org/version/1", "title": "Jampamane", "home_page_url": "https://www.jampamane.org/", "feed_url": "https://www.jampamane.org/feed_json_updated.json", "description": "The offical personal / professional website for Jeremy Brandow", "icon": null, "authors": [], "language": "en", "items": [{"id": "https://www.jampamane.org/blog/2025/03/05/the-first-post/", "url": "https://www.jampamane.org/blog/2025/03/05/the-first-post/", "title": "The First Post", "content_html": "<h1>The First Post</h1>\n<p>It's overcast today.</p>\n<p>Here I am, sitting at work looking out the window wondering why I'm starting this blog in the first place.</p>\n<p>Yesterday I supervised my 3 year old son as he painted a picture. The picture in question was, as you can imagine, just a bunch of water colored blobs on a page. For a while he mixed the colors, practiced holding a paintbrush, and named each color in wonder as he put them on the paper. When he was finished working on his own, he handed me a paintbrush. I helped him fill in the gaps and smooth out the colors while he continued to add more paint to the page.</p>", "image": null, "date_modified": "2025-03-13T18:51:31+00:00", "authors": [{"name": "Jeremy Brandow"}], "tags": null}, {"id": "https://www.jampamane.org/blog/2025/03/07/i-used-to-be-mormon/", "url": "https://www.jampamane.org/blog/2025/03/07/i-used-to-be-mormon/", "title": "I Used to be Mormon", "content_html": "<h1>I Used to be Mormon</h1>\n<p>It wasn’t going to go away, no matter how much I tried not to think about it. The thought had taken permanent residence on a shelf in my brain titled: <em>Future Problems</em>. It was a future problem that was fast approaching, like a knife wielding horror cliche chasing me in the forest, who just now broke out into a sprint.</p>\n<p>I was having trouble describing what I was feeling. It was a kind of fear mixed with uncertainty? And then pan tossed with insecurity? Is this what anxiety felt like? Wasn’t I just in High School? Wasn’t graduation only a month ago? I had already said goodbye to my graduating class, and now I have to say goodbye to my friends and family?</p>", "image": null, "date_modified": "2025-03-13T18:51:31+00:00", "authors": [{"name": "Jeremy Brandow"}], "tags": null}, {"id": "https://www.jampamane.org/blog/2025/03/11/laundry/", "url": "https://www.jampamane.org/blog/2025/03/11/laundry/", "title": "Laundry", "content_html": "<h1>Laundry</h1>\n<p>Sunday had arrived once again.</p>\n<p>I loaded up the car with 2 weeks worth of laundry and pulled out of the apartment complex. My wife, fighting an unknown sickness, would not be joining me. Without her voice to fill the silence my mind drifts into a hypothetical future. I think about a future where we have our own washer and dryer. I think about a future where I'm not in college and I don't need to rely on my parents. I think about a future where I don't need to drive 40 minutes to do laundry.</p>\n<p>Pulling into my parents driveway I notice both of their cars are gone. I’m admittedly relieved, as this means I can have a nice and quiet day of folding clothes. This, however, makes me feel guilty, as I don’t get to see my parents that often anymore.</p>", "image": null, "date_modified": "2025-03-13T18:51:31+00:00", "authors": [{"name": "Jeremy Brandow"}], "tags": null}]}